<?php
declare(strict_types=1);

return [
    'international_new_year' => 'បុណ្យចូលឆ្នាំសកល',
    'victory_over_genocide_regime' => 'ទិវាជ័យជម្នះលើរបបប្រល័យពូជសាសន៍',
    'international_womens_day' => 'ទិវាស្ត្រីអន្តរជាតិ',
    'king_fathers_memorial' => 'ទិវាពិធីបួងសួងព្រះវិញ្ញាណក្ខន្ធព្រះបរមរតនកោដ្ឋ',
    'khmer_new_year' => 'បុណ្យចូលឆ្នាំខ្មែរ',
    'khmer_new_year_description' => 'បុណ្យសំខាន់បំផុតនៅកម្ពុជា ដែលប្រារព្ធពិធីបិទបញ្ចប់រដូវកាត់ផ្តាច់ និងចាប់ផ្តើមឆ្នាំថ្មី។ ត្រូវបានប្រារព្ធជាប្រពៃណីរយៈពេល ៣-៤ ថ្ងៃជាមួយនឹងពិធីបុណ្យ ល្បែង និងការប្រជុំគ្រួសារផ្សេងៗ។',
    'visak_bochea' => 'បុណ្យវិសាខបូជា',
    'visak_bochea_description' => 'បុណ្យព្រះពុទ្ធសាសនា ដែលរំលឹកដល់ការប្រសូត្រ ការត្រាស់ដឹង និងការចូលនិព្វានរបស់ព្រះពុទ្ធ។',
    'pchum_ben' => 'បុណ្យភ្ជុំបិណ្ឌ',
    'pchum_ben_description' => 'បុណ្យ ១៥ ថ្ងៃដើម្បីគោរពដល់ជីដូនជីតាដែលបានទៅកាន់បរលោក ដែលបញ្ចប់នៅថ្ងៃទី ១៥ (ព្រះច័ន្ទពេញវង់) នៃខែអស្សុជ។',
    'meak_bochea' => 'បុណ្យមាឃបូជា',
    'meak_bochea_description' => 'បុណ្យព្រះពុទ្ធសាសនា ដែលរំលឹកដល់ថ្ងៃដែលព្រះសង្ឃ ១,២៥០ អង្គបានប្រមូលផ្តុំដោយស្វ័យប្រវត្តិដើម្បីស្តាប់ព្រះពុទ្ធសម្តែងធម៌។',
    'chinese_new_year' => 'បុណ្យចូលឆ្នាំចិន',
    'chinese_new_year_description' => 'ការប្រារព្ធពិធីចូលឆ្នាំចិន ដែលត្រូវបានប្រារព្ធដោយសហគមន៍ចិននៅកម្ពុជា។',
];
